src/cf/InformationRegisters/МП_ИзмененныеТрудозатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МП_ИзмененныеТрудозатраты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Удалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДобавления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/МП_ИзмененныеТрудозатраты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ИзменитьЗапись(Пользователь, Период, НомерДобавления, Удалена = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователь);
	НЗ.Отбор.НомерДобавления.Установить(НомерДобавления);
	НЗ.Отбор.День.Установить(НачалоДня(Период));
	
	МЗ = НЗ.Добавить();
	МЗ.День = НачалоДня(Период);
	МЗ.Пользователь = Пользователь;
	МЗ.НомерДобавления = НомерДобавления;
	МЗ.ОтметкаВремени = ОтметкиВремени.Текущая();
	МЗ.Удалена = Удалена;
	НЗ.Записать();
	
КонецПроцедуры

Функция ОтметкаВремениУстарела(МобильноеПриложение, Пользователь, Период, НомерДобавления) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МП_СведенияОПользователя.ОтметкаВремениСборкиДанных КАК ОтметкаВремениСборкиДанных
		|ПОМЕСТИТЬ ПоследняяОтметкаСборкиДанных
		|ИЗ
		|	РегистрСведений.МП_СведенияОПользователя КАК МП_СведенияОПользователя
		|ГДЕ
		|	МП_СведенияОПользователя.ПользовательМобильногоПриложения = &МобильноеПриложение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	МП_ИзмененныеТрудозатраты.ОтметкаВремени КАК ОтметкаВремени
		|ИЗ
		|	РегистрСведений.МП_ИзмененныеТрудозатраты КАК МП_ИзмененныеТрудозатраты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследняяОтметкаСборкиДанных КАК ПоследняяОтметкаСборкиДанных
		|		ПО МП_ИзмененныеТрудозатраты.ОтметкаВремени > ПоследняяОтметкаСборкиДанных.ОтметкаВремениСборкиДанных
		|ГДЕ
		|	МП_ИзмененныеТрудозатраты.День = КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И МП_ИзмененныеТрудозатраты.Пользователь = &Пользователь
		|	И МП_ИзмененныеТрудозатраты.НомерДобавления = &НомерДобавления";
	
	Запрос.УстановитьПараметр("МобильноеПриложение", МобильноеПриложение);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НомерДобавления", НомерДобавления);
	Запрос.УстановитьПараметр("Период", Период);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура УдалитьЗаписьОТрудозатрате(Пользователь, День, НомерДобавления) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МП_ИзмененныеТрудозатраты.День КАК День
		|ИЗ
		|	РегистрСведений.МП_ИзмененныеТрудозатраты КАК МП_ИзмененныеТрудозатраты
		|ГДЕ
		|	МП_ИзмененныеТрудозатраты.Пользователь = &Пользователь
		|	И МП_ИзмененныеТрудозатраты.НомерДобавления = &НомерДобавления
		|	И МП_ИзмененныеТрудозатраты.День = НачалоПериода(&День, День)";
	
	Запрос.УстановитьПараметр("День", День);
	Запрос.УстановитьПараметр("НомерДобавления", НомерДобавления);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьЗапись(Пользователь, День, НомерДобавления, Истина);
	
КонецПроцедуры

#КонецЕсли
